import React from 'react';

const Card= ({ image, title, description }) => {
  return (
    <div className="max-w-sm rounded overflow-hidden shadow-lg m-4">
      <img className="w-full" src={image} alt={title} />
          <div className="px-6 py-4">
              <div className="font-bold text-xl mb-2">{title}</div>
                   <p className="text-gray-700 text-base">{description}</p>
    </div>
    </div>
  );
};

const Blogs = () => {
  return (
    <div className="flex flex-wrap justify-center">
        <Card image="./Assets/Img/oil.jpg" title="چگونه یک روتین مراقبت از پوست رو شروع کنیم؟"  description=" در کل یگ روتین ساده میتونه شامل پاک کننده و آبرسان و مرطوب کننده و ضد آفتاب بشه اگر تاحالا روتین نداشتید نیازی نیست خودتون رو خیلی گیج کنید با محصولات کم و روتین مرتب هم میتونید خیلی سریع به نتیجه های عالی برسید "/>


        <Card image="./Assets/Img/water.jpg" title="مرحله اول روتین پاکسازی پوست" description=" قبل از استفاده از هر محصولی باید پوسستون رو از آلودگی ها و آرایش پاک کنید تا محصولات بتونن جذب پوستتون بشن و . تاثیر بزارن روی پوستتون اگر آرایش دارید اولین مرحله پاکسازی پوستتون میشه میسلارواتر اگر ارایش سنگینی دارید. از یک روغن پاک کننده استفاده کنید مثل روغن ارایش پاک کن ایوروشه.بعد از پاک کردن آرایش هنوز کار ما و مرحله اول تموم نشده حالا نوبت به شوینده مناسب پوستتون میرسه که آلودگی رو کامل از پوستتو" />


        <Card image="./Assets/Img/toner.webp" title="مرحله دوم تونر پوستی" description=" تونر مرحله اجباری تو روتین نیست ولی اگر منافذ باز پوست دارید یا پوستتون مستعد جوش هست استفاده از تونر میتونه به روند درمان پوستتون کمک کنه  .اگر پوست خشکی دارید تونر های حاوی آلفا هیدروکسی رو امتحان کنید  ..تونر رو روزی دوبار تو روتین پوستی قرار بدید بعد از شوینده. البته میشه گفت تونر هم به پاک کردن و تمیزکردن پوستتون کمک میکنه نکته بعدی در مورد تونر اینه که به صورت مستقیم به پوستتون نزنید و از یک پد آرایشی برای زدن تونر به پوستتون استفاده کنید  .اکثر تونر ها نیاز به آبکشی ندارن" />


        <Card image="./Assets/Img/abresan.jpg"  title="مرحله سوم روتین سرم پوستی"description="میدونید که روتین از رقیق به غلیظ انجام میشه پس بعد از پاک کردن پوستتون باید از سرم ها استفاده کنید .سرم مثل ویتامین ث و لایه بردار ها وسرم هیالارونیک اسید که بسته به کاراییشون تو روتین شب و صبح قرار میگیره." />


        <Card image="./Assets/Img/eye cream.jpg "  title="مرحله چهارم کرم دور چشم "description="در مقایسه با کرم ها دور چشم ها رقیق تر هستند به همین دلیل قبل از کرم ها تو روتین باید استفاده بشه دور چشم رو دوبار در روز یک بار در روتین صبح و یکبار در روتین شب قرار بدید  دورچشم ها کارایی های متفاوتی دارن میتونه دور چشم جوانساز باشه و میتونه دور چشم آبرسان و یا دور چشم روشن کننده باشه  ی ترکیب عالی هم بهتون بگم اگر دور چشمتون تیرس بهترین دور چشم دور چشم های کافیین داره.بعد از دور چشم های کافیین دار برای جلوگیری از خشکی دور چشمتون از دورچشم آبرسان استفاده کنید " />


        <Card image="./Assets/Img/sun skin.jpg"  title="مرحله پنجم آبرسان و مرطوب کننده" description=" .و مرحله بعدی نوبت به کرم های پوستی میرسه کرمی که برای ما واجبه مثل آبرسان و مرطوب کننده هست  .دقت کنید که بیشتر محصولات خاصیت آبرسانی و مرطوب کنندگی رو با هم دارند ولی ممکنه محصولی فقط آبرسان باشهو نیاز باشه ما به شکل جداگانه مرطوب کننده بزنید .پس این دو مورد با هم تفاوت دارند." />



        <Card image="./Assets/Img/sun.jpg"  title="مرحله آخر البته در روتین روز ضد آفتتاب" description=" مرحله آخر البته در روتین روز ضد آفتتاب  .د آفتاب یکی از مهمترین محصولات روتین است اگر پوست ما در معرض نور آفتاب مستقیم باشد  .قطعا آسیب میبینه و دچار لک می شود پس برای جلوگیری از آسیب های ناشی از آفتاب حتما باید ضد آفتاب بزنید ضد آفتاب باید هر دو الی سه ساعت یکبار تمدید شود  " />


    </div>
  );
};

export default Blogs;
